    //https://codeforces.com/contest/1772/problem/A
    
    //================================================================================\\
    //===========================( اللهم صّلِ وسَلّمْ عَلۓِ نَبِيْنَا مُحَمد ﷺ )=========================\\
    //================================================================================\\
     
     
    #include<bits/stdc++.h>
    using namespace std;
     
   
    int main()
    {
      int t; cin>>t;
      while(t--){
        string s; cin>>s;
        int a=s[0]-'0';
        int c=s[2]-'0';
        cout<<a+c<<endl;
        
      }
    }
